LC2200 TEST CASES WITH PIPE COMMUNICATION

Proceeding all of these commands, initialize the machine.
"..." represents some set of output from the machine

./simTestFiles/LC2200

===================
     Test load     
===================

>load fact
...
>quit

===================
     Test step     
===================

>load fact
...
>step
>step
? 3
>quit

==================
     Test run     
==================

>load fact
...
>run
? 3
6
>quit

===============================
     Test mem (max length)     
===============================

>mem 0 1023
...
...
>quit


==================
     Test cpu     
==================

>cpu
...
>quit

=============================================
    Test execution of multiple programs     
=============================================

>load fact
...
>run
? 3
6
>load fact
...
>run
? 7
5040
>quit

============================
     Test invalid input     
============================

>hello
Invalid command.
>quit



Any of these cases are considered to have failed if any excess output
(not listed as "...") or error messages are produced.  This also
requires successful exit of the program.
